<template>
    <div class="about-block">
        <div class="about-text">
            <p><b>Добро пожаловать</b> на мой личный сайт - <b>fullstackdevblog.ru</b>. <b>Пока что</b> это по сути блог, который запустился в апреле 2025 года. По факту — <b>живой архив</b> моих знаний, заметок, конспектов, шпаргалок и т.п., который растёт вместе со мной. Только <b>свежий код</b>, <b>база</b>, <b>рабочие примеры</b> и <b>мысли</b>, которые ещё пахнут кофе. Сайт только <b>набирает ход</b>: база статей <b>пополняется</b>, разделы <b>обрастают деталями</b>, а некоторые темы <b>ждут своего часа</b> в черновиках.</p><br>
            <p><b>TODO:</b></p>
            <ul>
                <li>📝 <b>Go:</b> статья про асинхронность, файлы, сетевое программирование, базы данных, простой web</li>
                <li>📝 <b>Go:</b> статья про простой REST API сервис - доработать тесты, деплой, свагер</li>
                <li>📝 <b>Go: </b>статья про поднятие сервера gRPC API</li>
                <li>📝 <b>Vue 3:</b> статья с примером простого приложения</li>
                <li>📝 <b>JavaScript: </b>привести в порядок статьи</li>
                <br>
                <li>✅ <b>Go:</b> статья про простой REST API сервис</li>
                <li>✅ <b>Vue 3:</b> основы, формы, компоненты</li>
            </ul><br>
            <p><b>История:</b></p>
            <table>
                <tbody>
                    <tr>
                        <td><b><u>17.05.2025</u></b></td>
                        <td>Закончена статья по REST API приложению на Go. Надо бы больше тестов, и пошире сделать само апи, больше сущностей. Прикрутить свагер.</td>
                    </tr>
                    <tr>
                        <td><b><u>15.05.2025</u></b></td>
                        <td>Кипит работа над статьей по REST API приложению на Go.</td>
                    </tr>
                    <tr>
                        <td><b><u>13.05.2025</u></b></td>
                        <td>Праздники отгремели. Доделана основа Vue 3 (формы, компоненты). Надо собрать все в кучу и сделать простое приложение.</td>
                    </tr>
                    <tr>
                        <td><b><u>8.05.2025</u></b></td>
                        <td>Завершены основы Vue 3, закрепляем формами и компонентами.</td>
                    </tr>
                    <tr>
                        <td><b><u>6.05.2025</u></b></td>
                        <td>Начата работа над основами Vue 3.</td>
                    </tr>
                    <tr>
                        <td><b><u>4.05.2025</u></b></td>
                        <td>Праздники они такие, но работу надо продолжать. Добавлен этот раздел.</td>
                    </tr>
                    <tr>
                        <td><b><u>13.05.2025</u></b></td>
                        <td>Праздники отгремели. Доделана основа Vue 3 (формы, компоненты). Надо собрать все в кучу и сделать простое приложение.</td>
                    </tr>
                    <tr>
                        <td><b><u>28.04.2025</u></b></td>
                        <td>Пособеседовавшись тут недавно, было решено освоить в общих чертах такой набирающий популярность фреймворк как FastAPI. Любопытная штучка, но проигрывает Джанго во встроенных батарейках.</td>
                    </tr>
                    <tr>
                        <td><b><u>19.04.2025</u></b></td>
                        <td>Решил переключиться, и пробежаться по основам любимого Питона. Чисто заметка-напоминалка, в которую можно добавить инфы по тонкостям и фишкам-плюшкам.</td>
                    </tr>
                    <tr>
                        <td><b><u>18.04.2025</u></b></td>
                        <td>Не отходя далеко от кассы, вникаем в Го дальше.</td>
                    </tr>
                    <tr>
                        <td><b><u>10.04.2025</u></b></td>
                        <td>Всегда был очень интересен язык Go, параллельно с любимым Питоном. Учить его сложно :) особенно после змеюки. Вникаем, накидал конспект по основам GoLang.</td>
                    </tr>
                    <tr>
                        <td><b><u>8.04.2025</u></b></td>
                        <td>Продолжение пробежки по джаваскрипту, накидал конспект по функциональщине.</td>
                    </tr>
                    <tr>
                        <td><b><u>7.04.2025</u></b></td>
                        <td>Пробежка по основам джаваскрипта, накидал конспект по основе.</td>
                    </tr>
                    <tr>
                        <td><b><u>25.03.2025</u></b></td>
                        <td>Добавил свою старую статью по настройке JWT авторизации в Django.</td>
                    </tr>
                    <tr>
                        <td><b><u>18.03.2025</u></b></td>
                        <td>Добавил заметку по поднятию проекта Django под классический REST API.</td>
                    </tr>
                    <tr>
                        <td><b><u>15.03.2025</u></b></td>
                        <td>Создание сайта, продолжение знакомства и эксперименты с HTML CSS. Деплой на домашний сервер, домен.</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
</template>

<script>
export default {
  name: 'AppAbout' // Явное имя для ESLint
}
</script>

<script setup>
</script>

<style lang="scss" scoped>
.about-block {
    max-width: 80%;
    display: block;
    justify-content: center;
    align-items: center;
    background: var(--secondary);
    border-radius: 15px;
    border: 0.01rem solid gray;
    margin: 20px;
    padding: 20px;
    box-shadow: 0 2px 10px rgba(0,0,0,0.1);  /* Тень для глубины */
}
.about-text ul {
    margin-left: 30px;
}
table {
  width: 100%;
  border-collapse: collapse;
  font-family: 'Segoe UI', sans-serif;
  margin: 1rem 0;
  background: whitesmoke;
}
th {
  background: var(--accent); /* Темно-синий цвет */
  color: white;
  font-weight: 600;
  text-align: left;
  padding: 1.2rem;
  border-bottom: 3px solid #34495e;
}
td {
  padding: 1rem;
  border: 1px solid #0898bc; /* Светлая граница */
  color: #34495e; /* Темно-серый цвет текста */
}
@media (max-width: 768px) {
    .about-block {
        max-width: 100%;
    }
}
</style>
