<template>
  <div class="about-block">
      <div class="about-text">
        <p><b>Добро пожаловать</b> на мой личный сайт - <b>fullstackdevblog.ru</b>. <b>Пока что</b> это по сути блог, который запустился в апреле 2025 года. По факту — <b>живой архив</b> моих знаний, заметок, конспектов, шпаргалок и т.п., который растёт вместе со мной.</p>
        <br>
        <p>Только <b>свежий код</b>, <b>база</b>, <b>рабочие примеры</b> и <b>мысли</b>, которые ещё пахнут кофе. Сайт только <b>набирает ход</b>: база статей <b>пополняется</b>, разделы <b>обрастают деталями</b>, а некоторые темы <b>ждут своего часа</b> в черновиках.</p>
        <br>
        <p><b>Что делаем дальше:</b></p>
        <ul>
          <li>тут будут ближайшие планы</li>
        </ul>
        <br>
        <br>
        <br>
        <p><b>История:</b></p>
        <p><b><u>6 мая 2025</u></b>
        <br>Начата работа над основами Vue 3.</p>
        <br>
        <p><b><u>4 мая 2025</u></b>
        <br>Праздники они такие, но работу надо продолжать. Добавлен этот раздел.</p>
        <br>
        <p><b><u>28 Апреля 2025:</u></b>
        <br>Пособеседовавшись тут недавно, было решено освоить в общих чертах такой набирающий популярность фреймворк как FastAPI. Любопытная штучка, но проигрывает Джанго во встроенных батарейках.</p>
        <br>
        <p><b><u>19 Апреля 2025:</u></b>
        <br>Решил переключиться, и пробежаться по основам любимого Питона. Чисто заметка-напоминалка, в которую можно добавить инфы по тонкостям и фишкам-плюшкам.</p>
        <br>
        <p><b><u>18 Апреля 2025:</u></b>
        <br>Не отходя далеко от кассы, вникаем в Го дальше.</p>
        <br>
        <p><b><u>10 Апреля 2025:</u></b>
        <br>Всегда был очень интересен язык Go, даже параллельно с любимым Питоном. Учить его сложно :) особенно после змеюки. Вникаем, накидал конспект по основам GoLang.</p>
        <br>
        <p><b><u>8 Апреля 2025:</u></b>
        <br>Продолжение пробежки по ЖС, накидал конспект по функциональщине.</p>
        <br>
        <p><b><u>7 Апреля 2025:</u></b>
        <br>Пробежка по основам джаваскрипта (ЖС), накидал конспект по основе.</p>
        <br>
        <p><b><u>25 Марта 2025:</u></b>
        <br>Добавил свою старую статью по настрйоке JWT авторизации в Django.</p>
        <br>
        <p><b><u>18 Марта 2025:</u></b>
        <br>Добавил заметку по поднятию проекта Django под классический REST API.</p>
        <br>
        <p><b><u>15 Марта 2025:</u></b>
        <br>Создание сайта, продолжение знакомства и эксперименты с HTML CSS. Деплой на домашний сервер, домен.</p>
      </div>
    </div>
</template>

<script>
export default {
  name: 'AppAbout' // Явное имя для ESLint
}
</script>

<script setup>
</script>

<style lang="scss" scoped>
.about-block {
  max-width: 80%;
  display: block;
  justify-content: center;
  align-items: center;
  background: var(--secondary);
  border-radius: 15px;
  border: 0.01rem solid gray;
  margin: 20px;
  padding: 20px;
  box-shadow: 0 2px 10px rgba(0,0,0,0.1);  /* Тень для глубины */
}
.about-text ul {
  margin-left: 30px;
}
@media (max-width: 768px) {
  .about-block {
    max-width: 100%;
  }
}
</style>
