<template>
    <div class="about-block">
        <p>Добро пожаловать на сайт <b>fullstackdevblog.ru</b> - по сути техно- кодо- программистский блог (громко сказано), который запустился в марте-апреле 2025 года. По факту - живой архив моих знаний, заметок, конспектов, шпаргалок и т.п., который растёт вместе со мной.</p><br>
        <p><b>TODO:</b></p>
        <ul>
            <li>📝 <b>Go: </b>Конспект по структуре программы в книге Язык программирования Go, Донован и Керниган.</li>
            <li>📝 <b>Go: </b>Статья про поднятие сервера gRPC API</li>
            <li>📝 <b>Vue 3: </b>Статья с примером простого приложения</li>
            <li>📝 <b>JavaScript (?)</b></li>
            <br><hr><br>
            <li>✅ <b>Go:</b> Конспект по вступлению в книге Язык программирования Go, Донован и Керниган.</li>
            <li>✅ <b>Go:</b> Немного теории и практики по асинхронности и вводу-выводу</li>
            <li>✅ <b>Go:</b> Статья про простой REST API сервис (TODO: тесты, деплой, свагер)</li>
            <li>✅ <b>Vue 3:</b> Основы, формы, компоненты</li>
        </ul><br>
        <p><b>История:</b></p>
        <table>
            <tbody>
                <tr>
                    <td><b><u>24.05.2025</u></b></td>
                    <td>Читаем книгу Язык программирования Go by Донован и Керниган. Вступление.</td>
                </tr>
                <tr>
                    <td><b><u>19.05.2025</u></b></td>
                    <td>Статья по параллельному программированию, ввод-вывод в Go.</td>
                </tr>
                <tr>
                    <td><b><u>18.05.2025</u></b></td>
                    <td>Начинаю работу над Go gPRC. Параллельно закреплю асинхронность, файлы, сетевое программирование отдельной статьей.</td>
                </tr>
                <tr>
                    <td><b><u>17.05.2025</u></b></td>
                    <td>Закончена статья по REST API приложению на Go. Надо бы больше тестов, и пошире сделать само апи, больше сущностей. Прикрутить свагер.</td>
                </tr>
                <tr>
                    <td><b><u>15.05.2025</u></b></td>
                    <td>Кипит работа над статьей по REST API приложению на Go.</td>
                </tr>
                <tr>
                    <td><b><u>13.05.2025</u></b></td>
                    <td>Доделана основа Vue 3 (формы, компоненты). Надо собрать все в кучу и сделать простое приложение.</td>
                </tr>
                <tr>
                    <td><b><u>8.05.2025</u></b></td>
                    <td>Завершены основы Vue 3, закрепляем формами и компонентами.</td>
                </tr>
                <tr>
                    <td><b><u>6.05.2025</u></b></td>
                    <td>Начата работа над основами Vue 3.</td>
                </tr>
                <tr>
                    <td><b><u>4.05.2025</u></b></td>
                    <td>Майские праздники они такие, но работу надо продолжать. Добавлен этот раздел.</td>
                </tr>
                <tr>
                    <td><b><u>28.04.2025</u></b></td>
                    <td>Пособеседовавшись тут недавно, было решено освоить в общих чертах такой набирающий популярность фреймворк как FastAPI. Любопытная штучка, но проигрывает Django во встроенных батарейках.</td>
                </tr>
                <tr>
                    <td><b><u>25.04.2025</u></b></td>
                    <td>Завершены статьи по основам Go.</td>
                </tr>
                <tr>
                    <td><b><u>19.04.2025</u></b></td>
                    <td>Решил переключиться, и пробежаться по основам любимого Python. Чисто заметка-напоминалка, в которую можно добавить инфы по тонкостям и фишкам-плюшкам.</td>
                </tr>
                <tr>
                    <td><b><u>18.04.2025</u></b></td>
                    <td>Не отходя далеко от кассы, вникаем в Go дальше.</td>
                </tr>
                <tr>
                    <td><b><u>10.04.2025</u></b></td>
                    <td>Всегда был очень интересен язык Go, параллельно с любимым Python. Учить его конечно сложно :) Вникаем, накидал конспект по основам.</td>
                </tr>
                <tr>
                    <td><b><u>8.04.2025</u></b></td>
                    <td>Продолжение пробежки по JavaScript, накидал конспект по функциональщине.</td>
                </tr>
                <tr>
                    <td><b><u>7.04.2025</u></b></td>
                    <td>Пробежка по основам JavaScript, накидал конспект по основе.</td>
                </tr>
                <tr>
                    <td><b><u>25.03.2025</u></b></td>
                    <td>Добавил свою старую статью по настройке JWT авторизации в Django.</td>
                </tr>
                <tr>
                    <td><b><u>18.03.2025</u></b></td>
                    <td>Добавил заметку по поднятию проекта Django под классический REST API.</td>
                </tr>
                <tr>
                    <td><b><u>15.03.2025</u></b></td>
                    <td>Создание сайта, продолжение знакомства и эксперименты с HTML CSS. Деплой на домашний сервер, домен.</td>
                </tr>
            </tbody>
        </table>
    </div>
</template>

<script>
export default {
  name: 'AppAbout' // Явное имя для ESLint
}
</script>

<script setup>
</script>

<style lang="scss" scoped>
.about-block {
    background: var(--secondary);
    border-radius: 15px;
    border: 0.01rem solid rgb(220, 220, 220);
    margin: 20px;
    padding: 30px;
    box-shadow: 0 2px 10px rgba(0,0,0,0.1);  /* Тень для глубины */
}
.about-block ul {
    margin-left: 40px;
}
table {
    width: 100%;
    font-family: 'Segoe UI', sans-serif;
    background: whitesmoke;
}
td {
    padding: 0.4rem;
    border: 1px solid #6cb9ca;
    color: #34495e;
}
@media (max-width: 768px) {
    .about-block {
        padding: 15px;
        margin: 1px;
    }
}
</style>
